# Pandas in Python - p2

In [11]:
from io import StringIO
import pandas as pd

In [12]:
df = pd.read_csv("MercedezBenz.csv") #convert to dataFrame
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,2\n'
        'c,d,3'
       )
type(data)

str

In [15]:
#in memory file format object
StringIO(data)

In [16]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [17]:
pd.read_csv(StringIO(data), usecols=['col1','col2'])

  col1 col2
0    x    y
1    a    b
2    c    d

In [19]:
df = pd.read_csv("MercedezBenz.csv", usecols=['X0','X1','X2','X3','X4','X5']) #convert to dataFrame
df.head()

   X0 X1  X2 X3 X4 X5
0   k  v  at  a  d  u
1   k  t  av  e  d  y
2  az  w   n  c  d  x
3  az  t   n  f  d  x
4  az  v   n  f  d  h

In [20]:
df.to_csv('test.csv')

In [21]:
df.to_csv('test.csv', index=False) #remove index as it is already there in csv file

## datatypes in csv

In [22]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,2\n'
        'c,d'
       )

In [25]:
df=pd.read_csv(StringIO(data))

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      object
 1   col2    3 non-null      object
 2   col3    2 non-null      float64
dtypes: float64(1), object(2)
memory usage: 200.0+ bytes

In [28]:
df=pd.read_csv(StringIO(data), dtype="object")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      object
 1   col2    3 non-null      object
 2   col3    2 non-null      object
dtypes: object(3)
memory usage: 200.0+ bytes

In [29]:
df.head()

  col1 col2 col3
0    x    y    1
1    a    b    2
2    c    d  NaN

In [31]:
df.isnull().sum()

col1    0
col2    0
col3    1
dtype: int64

In [32]:
df['col1']

0    x
1    a
2    c
Name: col1, dtype: object

In [33]:
df['col1'][0]

'x'

In [34]:
data = ('a,b,c,d\n'
        '1,2,3,4\n'
        '5,6,7,8\n'
        '9,10,11'
       )

In [35]:
df=pd.read_csv(StringIO(data), dtype={'a':int, 'b':float, 'c':'int'})

In [36]:
df

   a     b   c    d
0  1   2.0   3  4.0
1  5   6.0   7  8.0
2  9  10.0  11  NaN

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      int32
 3   d       2 non-null      float64
dtypes: float64(2), int32(2)
memory usage: 200.0 bytes

In [39]:
df.dtypes

a      int32
b    float64
c      int32
d    float64
dtype: object

In [40]:
data = ('index,a,b,c\n'
        '4,apple,bat,5.7\n'
        '8,orange,cow,10')

In [41]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [42]:
#use index cols and usecols
data = ('a,b,c\n'
        '4,apple,bat\n'
        '8,orange,cow')

In [43]:
pd.read_csv(StringIO(data),usecols=['a','b','c'],index_col=0)

        b    c
a
4   apple  bat
8  orange  cow

In [44]:
pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t') #file seperated by tab

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359
...,...,...,...,...,...
395,SSEA011,College textbooks,3,T,314
396,SSEE041,Smartphones,4,T,335
397,SSFV031A,Food at elementary and secondary schools,3,T,122
398,SSGE013,Infants' equipment,3,T,356
399,SSHJ031,Infants' furniture,3,T,165

In [46]:
pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t').to_csv('test1.csv', index=False)